run/sphere/U0.1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Parameters To Change
D 1;
nr 8;
nL 6.0;
nw 0.5; // (boundary layer thickness in radiuses): 0 < nw < 1

/* SPHERICAL COORDINATES
X = Rp*COS(PHI)*SIN(THETA)
Y = Rp*SIN(PHI)*SIN(THETA)
Z = Rp*COS(THETA)
*/

// Calculated parameters

nl #calc "$nr * floor($nL - $nw - 1)";
O 0;
Rp #calc "$D / 2.0";
Rm #calc "-$Rp";
Dw #calc "$Rp*$nw";
Rpw #calc "$Rp+$Dw";
Rmw #calc "-$Rpw";
Rp05 #calc "$Rp/2.0";
Rm05 #calc "-$Rp05";
Rpw05 #calc "$Rpw/2.0";
Rmw05 #calc "-$Rpw05";
Rpsq #calc "$Rp*sqrt(2.0)/2.0";
Rmsq #calc "-$Rpsq";
Rpwsq #calc "$Rpw*sqrt(2.0)/2.0";
Rmwsq #calc "-$Rpwsq";
Rpsc #calc "$Rp*sqrt(3.0)/3.0";
Rmsc #calc "-$Rpsc";
Rpwsc #calc "$Rpw*sqrt(3.0)/3.0";
Rmwsc #calc "-$Rpwsc";
Lp #calc "$Rpw +$Rp";
Lm #calc "-$Lp";
Hp #calc "$Lp*($nL -$nw -1)";
Hm #calc "-$Hp";

vertices
(

        // SPHERE
        ($Rp $O $O)             //0
        ($Rm $O $O)             //1
        ($O $Rp $O)             //2
        ($O $Rm $O)             //3
        ($O $O $Rp)             //4
        ($O $O $Rm)             //5
        ($Rpsc $Rpsc $Rpsc)     //6
        ($Rmsc $Rmsc $Rmsc)     //7
        ($Rpsc $Rpsc $Rmsc)     //8
        ($Rmsc $Rmsc $Rpsc)     //9
        ($Rmsc $Rpsc $Rpsc)     //10
        ($Rpsc $Rmsc $Rmsc)     //11
        ($Rmsc $Rpsc $Rmsc)     //12
        ($Rpsc $Rmsc $Rpsc)     //13
        ($Rpsq $Rpsq $O)        //14
        ($Rmsq $Rmsq $O)        //15
        ($Rpsq $O $Rpsq)        //16
        ($Rmsq $O $Rmsq)        //17
        ($O $Rpsq $Rpsq)        //18
        ($O $Rmsq $Rmsq)        //19
        ($Rpsq $Rmsq $O)        //20
        ($Rmsq $Rpsq $O)        //21
        ($Rpsq $O $Rmsq)        //22
        ($Rmsq $O $Rpsq)        //23
        ($O $Rpsq $Rmsq)        //24
        ($O $Rmsq $Rpsq)        //25
        // BOUNDARY LAYER
        ($Rpw $O $O)            //26
        ($Rmw $O $O)            //27
        ($O $Rpw $O)            //28
        ($O $Rmw $O)            //29
        ($O $O $Rpw)            //30
        ($O $O $Rmw)            //31
        ($Rpwsc $Rpwsc $Rpwsc)  //32
        ($Rmwsc $Rmwsc $Rmwsc)  //33
        ($Rpwsc $Rpwsc $Rmwsc)  //34
        ($Rmwsc $Rmwsc $Rpwsc)  //35
        ($Rmwsc $Rpwsc $Rpwsc)  //36
        ($Rpwsc $Rmwsc $Rmwsc)  //37
        ($Rmwsc $Rpwsc $Rmwsc)  //38
        ($Rpwsc $Rmwsc $Rpwsc)  //39
        ($Rpwsq $Rpwsq $O)      //40
        ($Rmwsq $Rmwsq $O)      //41
        ($Rpwsq $O $Rpwsq)      //42
        ($Rmwsq $O $Rmwsq)      //43
        ($O $Rpwsq $Rpwsq)      //44
        ($O $Rmwsq $Rmwsq)      //45
        ($Rpwsq $Rmwsq $O)      //46
        ($Rmwsq $Rpwsq $O)      //47
        ($Rpwsq $O $Rmwsq)      //48
        ($Rmwsq $O $Rpwsq)      //49
        ($O $Rpwsq $Rmwsq)      //50
        ($O $Rmwsq $Rpwsq)      //51

        // ADAPTION
        ($Lp $O $O)             //52
        ($Lm $O $O)             //53
        ($O $Lp $O)             //54
        ($O $Lm $O)             //55
        ($O $O $Lp)             //56
        ($O $O $Lm)             //57
        ($Lp $Lp $Lp)           //58
        ($Lm $Lm $Lm)           //59
        ($Lp $Lp $Lm)           //60
        ($Lm $Lm $Lp)           //61
        ($Lm $Lp $Lp)           //62
        ($Lp $Lm $Lm)           //63
        ($Lm $Lp $Lm)           //64
        ($Lp $Lm $Lp)           //65
        ($Lp $Lp $O)            //66
        ($Lm $Lm $O)            //67
        ($Lp $O $Lp)            //68
        ($Lm $O $Lm)            //69
        ($O $Lp $Lp)            //70
        ($O $Lm $Lm)            //71
        ($Lp $Lm $O)            //72
        ($Lm $Lp $O)            //73
        ($Lp $O $Lm)            //74
        ($Lm $O $Lp)            //75
        ($O $Lp $Lm)            //76
        ($O $Lm $Lp)            //77

        // EXTERNAL
        ($Hp $O $O)             //78
        ($Hm $O $O)             //79
        ($O $Hp $O)             //80
        ($O $Hm $O)             //81
        ($O $O $Hp)             //82
        ($O $O $Hm)             //83
        ($Hp $Hp $Hp)           //84
        ($Hm $Hm $Hm)           //85
        ($Hp $Hp $Hm)           //86
        ($Hm $Hm $Hp)           //87
        ($Hm $Hp $Hp)           //88
        ($Hp $Hm $Hm)           //89
        ($Hm $Hp $Hm)           //90
        ($Hp $Hm $Hp)           //91
        ($Hp $Hp $O)            //92
        ($Hm $Hm $O)            //93
        ($Hp $O $Hp)            //94
        ($Hm $O $Hm)            //95
        ($O $Hp $Hp)            //96
        ($O $Hm $Hm)            //97
        ($Hp $Hm $O)            //98
        ($Hm $Hp $O)            //99
        ($Hp $O $Hm)            //100
        ($Hm $O $Hp)            //101
        ($O $Hp $Hm)            //102
        ($O $Hm $Hp)            //103
        ($Hp $Lp $Hp)           //104-84
        ($Hp $Lp $O)            //105-92
        ($Lp $Hp $Lp)           //106-84
        ($Lp $Hp $O)            //107-92
        ($O $Lp $Hp)            //108-96
        ($Hm $Hp $Lp)           //109-88
        ($O $Hp $Lp)            //110-96
        ($Hm $Lp $Hp)           //111-88
        ($Lm $Hp $O)            //112-99
        ($Lm $Hp $Lp)           //113-109
        ($Hm $Lp $O)            //114-99
        ($Lm $Hp $Hm)           //115-90
        ($Hm $Lp $Hm)           //116-90
        ($O $Lp $Hm)            //117-102
        ($O $Hp $Lm)            //118-102
        ($Lm $Hp $Lm)           //119-115
        ($Hp $Hp $Lm)           //120-86
        ($Hp $Lp $Hm)           //121-86
        ($Lp $Hp $Lm)           //122-120
        ($Lm $Hm $Hp)           //123-87
        ($Lm $Hm $O)            //124-93
        ($Hm $Lm $Hp)           //125-87
        ($O $Lm $Hp)            //126-103
        ($Hm $Lm $O)            //127-93
        ($O $Hm $Lp)            //128-103
        ($Lm $Hm $Lp)           //129-123
        ($Hp $Hm $Lp)           //130-91
        ($Hp $Lm $Hp)           //131-91
        ($Lp $Hm $O)            //132-98
        ($Lp $Hm $Lp)           //133-130
        ($Hp $Lm $O)            //134-98
        ($Lm $Hm $Hm)           //135-85
        ($Hm $Lm $Hm)           //136-85
        ($O $Hm $Lm)            //137-97
        ($Lm $Hm $Lm)           //138-135
        ($O $Lm $Hm)            //139-97
        ($Lp $Hm $Hm)           //140-89
        ($Hp $Lm $Hm)           //141-89
        ($Lp $Hm $Lm)           //142-140
        ($Hp $O $Lp)            //143-94
        ($Hp $Lp $Lp)           //144-104
        ($Hp $Lm $Lp)           //145-131
        ($Hp $O $Lm)            //146-100
        ($Hp $Lp $Lm)           //147-121
        ($Hp $Lm $Lm)           //148-141
        ($Hm $O $Lp)            //149-101
        ($Hm $Lp $Lp)           //150-111
        ($Hm $Lm $Lp)           //151-125
        ($Hm $O $Lm)            //152-95
        ($Hm $Lp $Lm)           //153-116
        ($Hm $Lm $Lm)           //154-136
        ($Lp $O $Hp)            //155-94
        ($Lp $Lp $Hp)           //156-104
        ($Lp $Lm $Hp)           //157-91
        ($Lm $O $Hp)            //158-101
        ($Lm $Lp $Hp)           //159-111
        ($Lm $Lm $Hp)           //160-125
        ($Lp $O $Hm)            //161-100
        ($Lp $Lp $Hm)           //162-121
        ($Lp $Lm $Hm)           //163-141
        ($Lm $O $Hm)            //164-95
        ($Lm $Lp $Hm)           //165-116
        ($Lm $Lm $Hm)           //166-136
        ($Hp $Hp $Lp)           //167-84
        ($Lp $Hp $Hp)           //168-84
        ($Lp $Hp $Hm)           //169-86
        ($Lp $Hm $Hp)           //170-91
        ($Hp $Hm $Lm)           //171-89
        ($Lm $Hp $Hp)           //172-88
        ($Hm $Hp $Lm)           //173-90
        ($Hm $Hm $Lm)           //174-85
        ($Hm $Hm $Lp)           //175-87
);

blocks
(
      // BNOUNDARY LAYER
      //FIRST
      hex (0 14 6 16 26 40 32 42) ($nr $nr $nr) simpleGrading (1 1 1)        //0
      hex (14 2 18 6 40 28 44 32) ($nr $nr $nr) simpleGrading (1 1 1)        //1
      hex (4 16 6 18 30 42 32 44) ($nr $nr $nr) simpleGrading (1 1 1)        //2
      //SECOND
      hex (2 21 10 18 28 47 36 44) ($nr $nr $nr) simpleGrading (1 1 1)       //3
      hex (21 1 23 10 47 27 49 36) ($nr $nr $nr) simpleGrading (1 1 1)       //4
      hex (4 18 10 23 30 44 36 49) ($nr $nr $nr) simpleGrading (1 1 1)       //5
      //THIRD
      hex (1 15 9 23 27 41 35 49) ($nr $nr $nr) simpleGrading (1 1 1)        //6
      hex (15 3 25 9 41 29 51 35) ($nr $nr $nr) simpleGrading (1 1 1)        //7
      hex (4 23 9 25 30 49 35 51) ($nr $nr $nr) simpleGrading (1 1 1)        //8
      //FOURTH
      hex (3 20 13 25 29 46 39 51) ($nr $nr $nr) simpleGrading (1 1 1)       //9
      hex (20 0 16 13 46 26 42 39) ($nr $nr $nr) simpleGrading (1 1 1)       //10
      hex (4 25 13 16 30 51 39 42) ($nr $nr $nr) simpleGrading (1 1 1)       //11
      //FIFTH
      hex (0 22 8 14 26 48 34 40) ($nr $nr $nr) simpleGrading (1 1 1)        //12
      hex (14 8 24 2 40 34 50 28) ($nr $nr $nr) simpleGrading (1 1 1)        //13
      hex (5 24 8 22 31 50 34 48) ($nr $nr $nr) simpleGrading (1 1 1)        //14
      //SIXTH
      hex (2 24 12 21 28 50 38 47) ($nr $nr $nr) simpleGrading (1 1 1)       //15
      hex (21 12 17 1 47 38 43 27) ($nr $nr $nr) simpleGrading (1 1 1)       //16
      hex (5 17 12 24 31 43 38 50) ($nr $nr $nr) simpleGrading (1 1 1)       //17
      //SEVENTH
      hex (1 17 7 15 27 43 33 41) ($nr $nr $nr) simpleGrading (1 1 1)        //18
      hex (15 7 19 3 41 33 45 29) ($nr $nr $nr) simpleGrading (1 1 1)        //19
      hex (5 19 7 17 31 45 33 43) ($nr $nr $nr) simpleGrading (1 1 1)        //20
      //EIGTHTH
      hex (3 19 11 20 29 45 37 46) ($nr $nr $nr) simpleGrading (1 1 1)       //21
      hex (20 11 22 0 46 37 48 26) ($nr $nr $nr) simpleGrading (1 1 1)       //22
      hex (5 22 11 19 31 48 37 45) ($nr $nr $nr) simpleGrading (1 1 1)       //23
      //ADAPTION
      //Xp
      hex (26 40 32 42 52 66 58 68) ($nr $nr $nr) simpleGrading (1 1 1)      //24
      hex (46 26 42 39 72 52 68 65) ($nr $nr $nr) simpleGrading (1 1 1)      //25
      hex (26 48 34 40 52 74 60 66) ($nr $nr $nr) simpleGrading (1 1 1)      //26
      hex (46 37 48 26 72 63 74 52) ($nr $nr $nr) simpleGrading (1 1 1)      //27
      //Yp
      hex (28 47 36 44 54 73 62 70) ($nr $nr $nr) simpleGrading (1 1 1)      //28
      hex (40 28 44 32 66 54 70 58) ($nr $nr $nr) simpleGrading (1 1 1)      //29
      hex (28 50 38 47 54 76 64 73) ($nr $nr $nr) simpleGrading (1 1 1)     //30
      hex (40 34 50 28 66 60 76 54) ($nr $nr $nr) simpleGrading (1 1 1)     //31
      //Zp
      hex (30 42 32 44 56 68 58 70) ($nr $nr $nr) simpleGrading (1 1 1)      //32
      hex (30 44 36 49 56 70 62 75) ($nr $nr $nr) simpleGrading (1 1 1)     //33
      hex (30 49 35 51 56 75 61 77) ($nr $nr $nr) simpleGrading (1 1 1)    //34
      hex (30 51 39 42 56 77 65 68) ($nr $nr $nr) simpleGrading (1 1 1)     //35
      //Xm
      hex (47 27 49 36 73 53 75 62) ($nr $nr $nr) simpleGrading (1 1 1)     //36
      hex (27 41 35 49 53 67 61 75) ($nr $nr $nr) simpleGrading (1 1 1)     //37
      hex (47 38 43 27 73 64 69 53) ($nr $nr $nr) simpleGrading (1 1 1)      //38
      hex (27 43 33 41 53 69 59 67) ($nr $nr $nr) simpleGrading (1 1 1)      //39
      //Ym
      hex (41 29 51 35 67 55 77 61) ($nr $nr $nr) simpleGrading (1 1 1)     //40
      hex (29 46 39 51 55 72 65 77) ($nr $nr $nr) simpleGrading (1 1 1)     //41
      hex (41 33 45 29 67 59 71 55) ($nr $nr $nr) simpleGrading (1 1 1)      //42
      hex (29 45 37 46 55 71 63 72) ($nr $nr $nr) simpleGrading (1 1 1)      //43
      //Zm
      hex (31 50 34 48 57 76 60 74) ($nr $nr $nr) simpleGrading (1 1 1)     //44
      hex (31 43 38 50 57 69 64 76) ($nr $nr $nr) simpleGrading (1 1 1)     //45
      hex (31 45 33 43 57 71 59 69) ($nr $nr $nr) simpleGrading (1 1 1)      //46
      hex (31 48 37 45 57 74 63 71) ($nr $nr $nr) simpleGrading (1 1 1)      //47
      // EXTERNAL
      //Xp
      hex (52 66 58 68 78 105 144 143) ExtXp1 ($nr $nr $nl) simpleGrading (1 1 1)    //48
      hex (72 52 68 65 134 78 143 145) ExtXp2 ($nr $nr $nl) simpleGrading (1 1 1)             //49
      hex (52 74 60 66 78 146 147 105) ExtXp3 ($nr $nr $nl) simpleGrading (1 1 1)            //50
      hex (72 63 74 52 134 148 146 78) ExtXp4 ($nr $nr $nl) simpleGrading (1 1 1)            //51
      //Yp
      hex (54 73 62 70 80 112 113 110) ExtYp1 ($nr $nr $nl) simpleGrading (1 1 1)   //52
      hex (66 54 70 58 107 80 110 106) ExtYp2 ($nr $nr $nl) simpleGrading (1 1 1)   //53
      hex (54 76 64 73 80 118 119 112) ExtYp3 ($nr $nr $nl) simpleGrading (1 1 1)     //54
      hex (66 60 76 54 107 122 118 80) ExtYp4 ($nr $nr $nl) simpleGrading (1 1 1)     //55
      //Zp
      hex (56 68 58 70 82 155 156 108) ExtZp1 ($nr $nr $nl) simpleGrading (1 1 1)      //56
      hex (56 70 62 75 82 108 159 158) ExtZp2 ($nr $nr $nl) simpleGrading (1 1 1)     //57
      hex (56 75 61 77 82 158 160 126) ExtZp3 ($nr $nr $nl) simpleGrading (1 1 1)             //58
      hex (56 77 65 68 82 126 157 155) ExtZp4 ($nr $nr $nl) simpleGrading (1 1 1)              //59
      //Xm
      hex (73 53 75 62 114 79 149 150) ExtXm1 ($nr $nr $nl) simpleGrading (1 1 1)     //60
      hex (53 67 61 75 79 127 151 149) ExtXm2 ($nr $nr $nl) simpleGrading (1 1 1)     //59
      hex (73 64 69 53 114 153 152 79) ExtXm3 ($nr $nr $nl) simpleGrading (1 1 1)      //59
      hex (53 69 59 67 79 152 154 127) ExtXm4 ($nr $nr $nl) simpleGrading (1 1 1)      //59
      //Ym
      hex (67 55 77 61 124 81 128 129) ExtYm1 ($nr $nr $nl) simpleGrading (1 1 1)     //64
      hex (55 72 65 77 81 132 133 128) ExtYm2 ($nr $nr $nl) simpleGrading (1 1 1)     //65
      hex (67 59 71 55 124 138 137 81) ExtYm3 ($nr $nr $nl) simpleGrading (1 1 1)      //60
      hex (55 71 63 72 81 137 142 132) ExtYm4 ($nr $nr $nl) simpleGrading (1 1 1)      //67
      //Zm
      hex (57 76 60 74 83 117 162 161) ExtZm1 ($nr $nr $nl) simpleGrading (1 1 1)     //68
      hex (57 69 64 76 83 164 165 117) ExtZm2 ($nr $nr $nl) simpleGrading (1 1 1)     //69
      hex (57 71 59 69 83 139 166 164) ExtZm3 ($nr $nr $nl) simpleGrading (1 1 1)      //70
      hex (57 74 63 71 83 161 163 139) ($nr $nr $nl) simpleGrading (1 1 1)      //71
      // FINAL RIM
      //Corners Xp plane
      hex (168 156 58 106 84 104 144 167) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      hex (122 60 162 169 120 147 121 86) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      hex (133 65 157 170 130 145 131 91) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      hex (140 163 63 142 89 141 148 171) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      //Corners on Xm plane
      hex (172 113 62 159 88 109 150 111) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      hex (119 115 165 64 173 90 116 153) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      hex (166 135 138 59 136 85 174 154) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      hex (123 160 61 129 87 125 151 175) ($nl $nl $nl) simpleGrading (1 1 1)     //72
      //Sides
      //Put some comments here!
      hex (106 58 66 107 167 144 105 92) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (107 66 60 122 92 105 147 120) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (155 68 58 156 94 143 144 104) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (157 65 68 155 131 145 143 94) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (132 72 65 133 98 134 145 130) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (142 63 72 132 171 148 134 98) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (161 74 63 163 100 146 148 141) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (162 60 74 161 121 147 146 100) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (112 73 62 113 99 114 150 109) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (119 64 73 112 173 153 114 99) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (164 69 64 165 95 152 153 116) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (166 59 69 164 136 154 152 95) ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (124 67 59 138 93 127 154 174)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (129 61 67 124 175 151 127 93)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (158 75 61 160 101 149 151 125)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (159 62 75 158 111 150 149 101)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (106 110 70 58 168 96 108 156)  ($nr $nl $nl) simpleGrading (1 1 1)     //73
      hex (110 113 62 70 96 172 159 108)  ($nr $nl $nl) simpleGrading (1 1 1)     //73
      hex (128 77 61 129 103 126 160 123)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (133 65 77 128 170 157 126 103)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (139 71 59 166 97 137 138 135)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (163 63 71 139 140 142 137 97)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (118 76 64 119 102 117 165 115)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
      hex (122 60 76 118 169 162 117 102)  ($nl $nr $nl) simpleGrading (1 1 1)     //73
);

edges
(
    // BOUNDARY LAYER
    // FIRST
    arc 0 14  ($O $Rp $O)               //0
    arc 26 40 ($O $Rpw $O)              //1
    arc 0 16  ($O $O $Rp)               //2
    arc 26 42 ($O $O $Rpw)              //3
    arc 14 6  ($O $O $Rp)               //4
    arc 40 32 ($O $O $Rpw)              //5
    arc 6 16  ($Rmsc $Rmsc $Rmsc)       //6
    arc 32 42 ($Rmwsc $Rmwsc $Rmwsc)    //7
    arc 14 2  ($Rm $O $O)               //8
    arc 40 28 ($Rmw $O $O)              //9
    arc 2 18  ($O $O $Rp)               //10
    arc 28 44 ($O $O $Rpw)              //11
    arc 6 18  ($Rmsc $Rmsc $Rmsc)       //12
    arc 32 44 ($Rmwsc $Rmwsc $Rmwsc)    //13
    arc 4 16  ($Rp $O $O)               //14
    arc 30 42 ($Rpw $O $O)              //15
    arc 4 18  ($O $Rp $O)               //16
    arc 30 44 ($O $Rpw $O)              //17
    // SECOND
    arc 2 21  ($Rm $O $O)               //18
    arc 28 47 ($Rmw $O $O)              //19
    arc 21 10 ($O $O $Rp)               //20
    arc 47 36 ($O $O $Rpw)              //21
    arc 10 18 ($Rpsc $Rmsc $Rmsc)       //22
    arc 36 44 ($Rpwsc $Rmwsc $Rmwsc)    //23
    arc 1 21  ($O $Rp $O)               //24
    arc 27 47 ($O $Rpw $O)              //25
    arc 1 23  ($O $O $Rp)               //26
    arc 27 49 ($O $O $Rpw)              //27
    arc 10 23 ($Rpsc $Rmsc $Rmsc)       //28
    arc 36 49 ($Rpwsc $Rmwsc $Rmwsc)    //29
    arc 4 23  ($Rm $O $O)               //30
    arc 30 49 ($Rmw $O $O)              //31
    // THIRD
    arc 1 15  ($O $Rm $O)               //32
    arc 27 41 ($O $Rmw $O)              //33
    arc 15 9  ($O $O $Rp)               //34
    arc 41 35 ($O $O $Rpw)              //35
    arc 9 23  ($Rpsc $Rpsc $Rmsc)       //36
    arc 35 49 ($Rpwsc $Rpwsc $Rmwsc)    //37
    arc 15 3  ($Rp $O $O)               //38
    arc 41 29 ($Rpw $O $O)              //39
    arc 3 25  ($O $O $Rp)               //40
    arc 29 51 ($O $O $Rpw)              //41
    arc 9 25  ($Rpsc $Rpsc $Rmsc)       //42
    arc 35 51 ($Rpwsc $Rpwsc $Rmwsc)    //43
    arc 4 25  ($O $Rm $O)               //44
    arc 30 51 ($O $Rmw $O)              //45
    // FOURTH
    arc 3 20  ($Rp $O $O)               //46
    arc 29 46 ($Rpw $O $O)              //47
    arc 20 13 ($O $O $Rp)               //48
    arc 46 39 ($O $O $Rpw)              //49
    arc 13 25 ($Rmsc $Rpsc $Rmsc)       //50
    arc 39 51 ($Rmwsc $Rpwsc $Rmwsc)    //51
    arc 0 20  ($O $Rm $O)               //52
    arc 26 46 ($O $Rmw $O)              //53
    arc 13 16 ($Rmsc $Rpsc $Rmsc)       //54
    arc 39 42 ($Rmwsc $Rpwsc $Rmwsc)    //55
    // FIFTH
    arc 0 22  ($O $O $Rm)               //56
    arc 26 48 ($O $O $Rmw)              //57
    arc 14 8  ($O $O $Rm)               //58
    arc 40 34 ($O $O $Rmw)              //59
    arc 8 22  ($Rmsc $Rmsc $Rpsc)       //60
    arc 34 48 ($Rmwsc $Rmwsc $Rpwsc)    //61
    arc 8 24  ($Rmsc $Rmsc $Rpsc)       //62
    arc 34 50 ($Rmwsc $Rmwsc $Rpwsc)    //63
    arc 5 22  ($Rp $O $O)               //64
    arc 31 48 ($Rpw $O $O)              //65
    arc 5 24  ($O $Rp $O)               //64
    arc 31 50 ($O $Rpw $O)              //65
    arc 2 24  ($O $O $Rm)               //66
    arc 28 50 ($O $O $Rmw)              //67
    //SIXTH
    arc 21 12 ($O $O $Rm)               //68
    arc 47 38 ($O $O $Rmw)              //69
    arc 12 24 ($Rpsc $Rmsc $Rpsc)       //70
    arc 38 50 ($Rpwsc $Rmwsc $Rpwsc)    //71
    arc 1 17  ($O $O $Rm)               //72
    arc 27 43 ($O $O $Rmw)              //73
    arc 12 17 ($Rpsc $Rmsc $Rpsc)       //74
    arc 38 43 ($Rpwsc $Rmwsc $Rpwsc)    //75
    arc 5 17  ($Rm $O $O)               //76
    arc 31 43 ($Rmw $O $O)              //77
    //SEVENTH
    arc 15 7  ($O $O $Rm)               //78
    arc 41 33 ($O $O $Rmw)              //79
    arc 7 17  ($Rpsc $Rpsc $Rpsc)       //80
    arc 33 43 ($Rpwsc $Rpwsc $Rpwsc)    //81
    arc 3 19  ($O $O $Rm)               //82
    arc 29 45 ($O $O $Rmw)              //83
    arc 7 19  ($Rpsc $Rpsc $Rpsc)       //84
    arc 33 45 ($Rpwsc $Rpwsc $Rpwsc)    //85
    arc 5 19  ($O $Rm $O)               //86
    arc 31 45 ($O $Rmw $O)              //87
    //EIGTHTH
    arc 20 11 ($O $O $Rm)               //88
    arc 46 37 ($O $O $Rmw)              //89
    arc 11 19 ($Rmsc $Rpsc $Rpsc)       //90
    arc 37 45 ($Rmwsc $Rpwsc $Rpwsc)    //91
    arc 11 22 ($Rmsc $Rpsc $Rpsc)       //90
    arc 37 48 ($Rmwsc $Rpwsc $Rpwsc)    //91

);

boundary
(
    top
    {
        type patch; //3
        faces
        (
            (123 160 125 87)
            (160 158 101 125)
            (158 159 111 101)
            (159 172 88 111)
            (103 126 160 123)
            (126 82 158 160)
            (82 108 159 158)
            (108 96 172 159)
            (170 157 126 103)
            (157 155 82 126)
            (155 156 108 82)
            (156 168 96 108)
            (91 131 157 170)
            (131 94 155 157)
            (94 104 156 155)
            (104 84 168 156)
        );
    }

    bottom
    {
        type patch; //6
        faces
        (
            (115 165 116 90)
            (165 164 95 116)
            (164 166 136 95)
            (166 135 85 136)
            (102 117 165 115)
            (117 83 164 165)
            (83 139 166 164)
            (139 97 135 166)
            (169 162 117 102)
            (162 161 83 117)
            (161 163 139 83)
            (163 140 97 139)
            (86 121 162 169)
            (121 100 161 162)
            (100 141 163 161)
            (141 89 140 163)
        );
    }

    sphere
    {
        type wall; //0
        faces
        (
            //FIRST
            (0 14 6 16)   //0
            (14 2 18 6)   //1
            (4 16 6 18)   //2
            //SECOND
            (2 21 10 18)  //3
            (21 1 23 10)  //4
            (4 18 10 23)  //5
            //THIRD
            (1 15 9 23)   //6
            (15 3 25 9)   //7
            (4 23 9 25)   //8
            //FOURTH
            (3 20 13 25)  //9
            (20 0 16 13)  //10
            (4 25 13 16)  //11
            //FIFTH
            (0 22 8 14)   //12
            (14 8 24 2)   //13
            (5 24 8 22)   //14
            //SIXTH
            (2 24 12 21)  //15
            (21 12 17 1)  //16
            (5 17 12 24)  //17
            //SEVENTH
            (1 17 7 15)   //18
            (15 7 19 3)   //19
            (5 19 7 17)   //20
            //EIGTHTH
            (3 19 11 20)  //21
            (20 11 22 0)  //22
            (5 22 11 19)  //23
            );
    }

    sides
    {
        type patch; //1
        faces
        (
            (104 144 167 84)
            (144 105 92 167)
            (105 147 120 92)
            (147 121 86 120)
            (94 143 144 104)
            (143 78 105 144)
            (78 146 147 105)
            (146 100 121 147)
            (131 145 143 94)
            (145 134 78 143)
            (134 148 146 78)
            (148 141 100 146)
            (91 130 145 131)
            (130 98 134 145)
            (98 171 148 134)
            (171 89 141 148)
            (173 119 115 90)
            (119 118 102 115)
            (118 122 169 102)
            (122 120 86 169)
            (99 112 119 173)
            (112 80 118 119)
            (80 107 122 118)
            (107 92 120 122)
            (109 113 112 99)
            (113 110 80 112)
            (110 106 107 80)
            (106 167 92 107)
            (88 172 113 109)
            (172 96 110 113)
            (96 168 106 110)
            (168 84 167 106)
            (116 153 173 90)
            (153 114 99 173)
            (114 150 109 99)
            (150 111 88 109)
            (95 152 153 116)
            (152 79 114 153)
            (79 149 150 114)
            (149 101 111 150)
            (136 154 152 95)
            (154 127 79 152)
            (127 151 149 79)
            (151 125 101 149)
            (85 174 154 136)
            (174 93 127 154)
            (93 175 151 127)
            (175 87 125 151)
            (135 138 174 85)
            (138 124 93 174)
            (124 129 175 93)
            (129 123 87 175)
            (97 137 138 135)
            (137 81 124 138)
            (81 128 129 124)
            (128 103 123 129)
            (140 142 137 97)
            (142 132 81 137)
            (132 133 128 81)
            (133 170 103 128)
            (89 171 142 140)
            (171 98 132 142)
            (98 130 133 132)
            (130 91 170 133)
        );
    }



);

mergePatchPairs
(
);


// ************************************************************************* //
